import Vue from "vue";

// 生产环境中取消各种提示
Vue.config.productionTip = false;

/**
 * 整个应用的配置
 */
export const app = {
  // html中title标签的值
  title: "绝弹管理系统 - 遇到你不知道的风景",
};

// const el = {
//   0: "#409eff", // 无用
//   1: "64,158,255", // 无用
//   2: "#409eff", //原色
//   3: "#53a8ff", //1级 未用到
//   4: "#66b1ff", //2级 悬浮色
//   5: "#79bbff", //3级 未用到
//   6: "#8cc5ff", //4级
//   7: "#a0cfff", //5级
//   8: "#b3d8ff", //6级
//   9: "#c6e2ff", //7级
//   10: "#d9ecff",//8级
//   11: "#ecf5ff",//9级
//   12: "#f5faff", // 未用到 +5%白色
//   13: "#3a8ee6", // +10%黑色 点击色
//   14: "#337ecc", // 未用到 +20%黑色
//   15: "210,100.000%,62.549%", // 未用到 hsl
//   16: "#67C23A", //功能色-绿色
//   17: "#E6A23C",
//   18: "#F56C6C",
//   19: "#909399",
// }
