import Vue from "vue";

// 生产环境中取消各种提示
Vue.config.productionTip = false;

/**
 * 整个应用的配置
 */
export const app = {
  // html中title标签的值
  title: "绝弹管理系统 - 遇到你不知道的风景",
};

// forElement生成的主题色色板
// const el = {
//   0: "#409eff", // 无用
//   1: "64,158,255", // 无用
//   2: "#409eff", //原色
//   3: "#53a8ff", //1级 未用到
//   4: "#66b1ff", //2级 悬浮色
//   5: "#79bbff", //3级 未用到
//   6: "#8cc5ff", //4级
//   7: "#a0cfff", //5级
//   8: "#b3d8ff", //6级
//   9: "#c6e2ff", //7级
//   10: "#d9ecff",//8级
//   11: "#ecf5ff",//9级
//   12: "#f5faff", // 未用到 +5%白色
//   13: "#3a8ee6", // 点击色：+10%黑色
//   14: "#337ecc", // 未用到 +20%黑色
//   15: "210,100.000%,62.549%", // 未用到 hsl
// }
// 按钮
// 文字：color
// 边框：+60%白色
// 背景：+90%白色
// 悬浮：+20%白色
// 点击：+10%黑色

// 功能色-警告色
// 0: "#E6A23C"
// 1: "230,162,60"
// 2: "#e6a23c"
// 3: "#e9ab50"
// 4: "#ebb563" 用到：el-tag
// 5: "#eebe77"
// 6: "#f0c78a" hover
// 7: "#f3d19e" el-link-disabled
// 8: "#f5dab1" get
// 9: "#f8e3c5"
// 10: "#faecd8"
// 11: "#fdf6ec"
// 12: "#fefaf5"
// 13: "#cf9236"
// 14: "#b88230"
// 15: "36,77.273%,56.863%"
